org/jekyll/_posts/2024-09-25-definition-intelligence.html
---
layout: post.liquid
title:  "Definitions of Intelligence"
date: 2024-09-25 Do
last_updated: 2024-09-25 Do
tags:
  - journal
  - ai
  - intelligence
  - definition
categories: [journal]
permalink: /2024-09-25-definition-intelligence
toc: true
---

<p>
A reference card for definitions of intelligence.
</p>

<p>
This entry attempts to summarize the definitions of intelligence that
I am familiar with. It is the result of trying to organize my thoughts
on the subject. When reading multiple sources from various fields that
address the concept of intelligence, perspectives can
differ. Sometimes, it even seems as though they are discussing
entirely different topics.
</p>



<div id="outline-container-org093dd91" class="outline-2">
<h2 id="org093dd91"><span class="section-number-2">1.</span> Chollet: Intelligence as learning efficiency</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Definition:</b> Intelligence is the efficiency with which a learning
system turns experience and priors into general skill at previously
unseen tasks
</p>

<p>
<b>Proponent</b>: François Chollet
</p>

<p>
<b>Proposed metrics</b>: Skill Acquisition Efficiency (SAE)
</p>

<p>
<b>Perspective</b>: Emphasizes generalization and the ability to learn
 new tasks quickly from limited data. 
</p>
</div>
</div>



<div id="outline-container-org5f8a3f8" class="outline-2">
<h2 id="org5f8a3f8"><span class="section-number-2">2.</span> Hutter: Universal Artificial Intelligence</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Definition:</b> Intelligence measures the ability of an agent to
achieve goals in a wide range of environments
</p>

<p>
<b>Proponent:</b> Marcus Hutter
</p>

<p>
<b>Proposed metrics:</b> Universal Intelligence Measure (UIM); a formal
mathematical definition summing over all computable reward functions
weighted by their simplicity. 
</p>

<p>
<b>Perspective:</b> Provides a formal, mathematical framework based on
algorithmic information theory to define and measure intelligence. 
</p>
</div>
</div>



<div id="outline-container-org46552a9" class="outline-2">
<h2 id="org46552a9"><span class="section-number-2">3.</span> Schmidhuber: Compression progress</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Definition:</b> Intelligence is the ability to generate novel,
interesting actions or data by maximizing future expected reward or
compression progress
</p>

<p>
<b>Proponent:</b> Jürgen Schmidhuber
</p>

<p>
<b>Proposed metrics:</b> Measures based on Compression Progress;
improvement in predictive models driven by intrinsic motivation and
curiosity
</p>

<p>
<b>Perspective:</b> Highlights the role of intrinsic motivation,
curiosity, and data compression in discovering new patterns and
behaviors.
</p>
</div>
</div>


<div id="outline-container-org1046a5b" class="outline-2">
<h2 id="org1046a5b"><span class="section-number-2">4.</span> Mainstream AI: Task-specific metrics</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Definition:</b> Intelligence is often operationally defined by
performance on specific tasks or benchmarks without a unified
overarching definition
</p>

<p>
<b>Proponent:</b> N/A
</p>

<p>
<b>Proposed metrics:</b> Task-specific metrics such as Accuracy, F1
Score, BLEU Score, etc., depending on the taskk
</p>

<p>
<b>Perspective:</b> Focuses on empirical performance in narrow
domains, emphasizing results on established benchmarks over a
holistic definition of intelligence 
</p>
</div>
</div>


<div id="outline-container-org215ab9a" class="outline-2">
<h2 id="org215ab9a"><span class="section-number-2">5.</span> Psychometrics: Intelligence Quotient (IQ)</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>Definition:</b> Intelligence is the capacity for reasoning,
problem-solving, planning, abstract thinking, understanding complex
ideas, and learning from experience
</p>

<p>
<b>Proponent:</b> Psychometrics
</p>

<p>
<b>Proposed metrics:</b> Intelligence Quotient (IQ); standardized tests
measuring various cognitive abilities
</p>

<p>
<b>Perspective:</b> Emphasizes quantifiable cognitive abilities and
compares individuals to population norms, focusing on human
intelligence assessment 
</p>
</div>
</div>



<div id="outline-container-org4dfb994" class="outline-2">
<h2 id="org4dfb994"><span class="section-number-2">6.</span> Bostrom: Superintelligence</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>Definition:</b> Superintelligence refers to an intellect that greatly
surpasses the cognitive performance of humans in virtually all
domains of interest
</p>

<p>
<b>Proponent:</b> Nick Bostrom
</p>

<p>
<b>Proposed metrics:</b> No specific metric; concept explores potential
capabilities beyond human levels 
</p>

<p>
<b>Perspective:</b> Focuses on the implications, risks, and ethics
associated with creating intelligences that far exceed human
cognitive abilities 
</p>
</div>
</div>


<div id="outline-container-org77f0ac3" class="outline-2">
<h2 id="org77f0ac3"><span class="section-number-2">7.</span> Ethology: Animal intelligence</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>Definition:</b> Intelligence is the ability of an animal to adapt to
its environment, learn from experiences, solve problems, and use
tools 
</p>

<p>
<b>Proponent:</b> Ethology
</p>

<p>
<b>Proposed metrics:</b> Behavioral tests assessing problem-solving, tool
use, social learning, and communication abilities 
</p>

<p>
<b>Perspective:</b> Studies intelligence across different species,
emphasizing evolutionary adaptations and ecological contexts 
</p>
</div>
</div>



<div id="outline-container-org0efe5c5" class="outline-2">
<h2 id="org0efe5c5"><span class="section-number-2">8.</span> Human-like AI: Artificial General Intelligence (AGI)</h2>
<div class="outline-text-2" id="text-8">
<p>
<b>Definition:</b> Intelligence is the ability of an artificial agent to
understand, learn, and apply knowledge in a general, human-like way
across a wide range of tasks and domains 
</p>

<p>
<b>Proponent:</b> Various
</p>

<p>
<b>Proposed metrics:</b> No standardized metric yet; Turing Test, general
AI benchmarks, and evaluations across diverse tasks are used 
</p>

<p>
<b>Perspective:</b> Aims to develop machines with general cognitive
abilities comparable to humans, capable of understanding and
reasoning across various contexts 
</p>
</div>
</div>
